<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"3f5d541c486da81ef7edd13c7a4886decad11f8b87b11945da7a3c5d22bbaa5e","plan_job_ref":"Job Plan Airflow DAGs #450 at https://github.com/cal-itp/data-infra/actions/runs/16790635584","plan_out_hash":"622eb3df1e988c6391e29bcb7a6a94a4a7888ad4a898a94ad4b37c666ead62dd","plan_hash":"302f3bac7af77d5e0d94c8989c2309348765b0e0872b381140c8013aee27ec83","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "+75UUw==" -> (known after apply)
!~      detect_md5hash      = "kYJ017tQ9U4yBylbOoLHRw==" -> "different hash"
!~      generation          = 1754429793908797 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "kYJ017tQ9U4yBylbOoLHRw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/incremental_max_date.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/macros/incremental_max_date.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/macros/incremental_max_date.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs/_int_gtfs.yaml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "rwMIMA==" -> (known after apply)
!~      detect_md5hash      = "T07Rr8u8NH1CM9p/qlrCBA==" -> "different hash"
!~      generation          = 1749663114904700 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs/_int_gtfs.yaml"
!~      md5hash             = "T07Rr8u8NH1CM9p/qlrCBA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/_int_gtfs.yaml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_day_map_grouping.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "2HOvNA==" -> (known after apply)
!~      detect_md5hash      = "K4vxkantbpF/b938WRKLsQ==" -> "different hash"
!~      generation          = 1754428271377400 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_day_map_grouping.sql"
!~      md5hash             = "K4vxkantbpF/b938WRKLsQ==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_day_map_grouping.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_trip_updates_trip_summaries.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "/6PITQ==" -> (known after apply)
!~      detect_md5hash      = "XEnAEWZpoQOFGcwc4IHHfg==" -> "different hash"
!~      generation          = 1754428271088204 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_trip_updates_trip_summaries.sql"
!~      md5hash             = "XEnAEWZpoQOFGcwc4IHHfg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_trip_updates_trip_summaries.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "v0ba3w==" -> (known after apply)
!~      detect_md5hash      = "ixwmCbFgA9HXpdGzOqh3pg==" -> "different hash"
!~      generation          = 1754429795282716 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "ixwmCbFgA9HXpdGzOqh3pg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #450](https://github.com/cal-itp/data-infra/actions/runs/16790635584)